Revit 2026 API

# FloorFace Enumeration

---

An enumerated type listing floor face types (top or bottom)

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum FloorFace
```
```vb
Public Enumeration FloorFace
```
```cpp
public enum class FloorFace
```
```fsharp
type FloorFace
```

| Member name | Value | Description |
| --- | --- | --- |
| Bottom | 1 |  |
| Top | 0 |  |

#### Reference

Autodesk.Revit.DB Namespace